# Задача 4: Требуется вывести все целые степени двойки (т.е. числа вида 2^k), не превосходящие числа N.
# Пример 10: 0, 1, 2, 3

n = int(input("Введите число N: "))
i = 0
output = ""
while 2 ** i <= n:
    output += str(i) + ", "
    i += 1
output = output[:-2]

print(output)